# -*- coding: utf-8 -*-
"""
ØªÙ†Ø¸ÛŒÙ…Ø§Øª Ø§ØµÙ„ÛŒ Ø±Ø¨Ø§Øª
"""

# ØªÙˆÚ©Ù† Ø±Ø¨Ø§Øª Ø±Ø§ Ø§Ø² @BotFather Ø¨Ú¯ÛŒØ±ÛŒØ¯
BOT_TOKEN = "8928767143:AAE_CoG_mq_9BFinzft2r-jRbZkBflWBKxg"

# Ø¢ÛŒØ¯ÛŒ Ø¹Ø¯Ø¯ÛŒ Ø§Ø¯Ù…ÛŒÙ†â€ŒÙ‡Ø§ (Ù…ÛŒâ€ŒØªÙˆØ§Ù†ÛŒØ¯ Ø¨Ø§ Ø§Ø±Ø³Ø§Ù„ /myid Ø¨Ù‡ Ø±Ø¨Ø§Øª @userinfobot Ø¨Ú¯ÛŒØ±ÛŒØ¯)
ADMIN_IDS = [7041260675]  # Ø§ÛŒÙ† Ø¹Ø¯Ø¯ Ø±Ø§ Ø¨Ø§ Ø¢ÛŒØ¯ÛŒ Ø¹Ø¯Ø¯ÛŒ Ø®ÙˆØ¯ØªØ§Ù† Ø¬Ø§ÛŒÚ¯Ø²ÛŒÙ† Ú©Ù†ÛŒØ¯

# Ø¢ÛŒØ¯ÛŒ Ø¹Ø¯Ø¯ÛŒ ÛŒØ§ ÛŒÙˆØ²Ø±Ù†ÛŒÙ… Ú©Ø§Ù†Ø§Ù„ÛŒ Ú©Ù‡ Ø¢Ù‡Ù†Ú¯â€ŒÙ‡Ø§ Ø¯Ø± Ø¢Ù† Ù‚Ø±Ø§Ø± Ø¯Ø§Ø±Ø¯
# Ù†Ú©ØªÙ‡ Ù…Ù‡Ù…: Ø±Ø¨Ø§Øª Ø¨Ø§ÛŒØ¯ Ø¯Ø± Ø§ÛŒÙ† Ú©Ø§Ù†Ø§Ù„ Ø§Ø¯Ù…ÛŒÙ† Ø¨Ø§Ø´Ø¯ (Ø­ØªÛŒ Ø¨Ø¯ÙˆÙ† Ø¯Ø³ØªØ±Ø³ÛŒ Ø®Ø§ØµØŒ ÙÙ‚Ø· Ø¹Ø¶ÙˆÛŒØª Ø§Ø¯Ù…ÛŒÙ† Ú©Ø§ÙÛŒØ³Øª)
# Ù…Ø«Ø§Ù„ Ø¨Ø§ ÛŒÙˆØ²Ø±Ù†ÛŒÙ…: "@my_music_channel"
# Ù…Ø«Ø§Ù„ Ø¨Ø§ Ø¢ÛŒØ¯ÛŒ Ø¹Ø¯Ø¯ÛŒ (Ø¨Ø±Ø§ÛŒ Ú©Ø§Ù†Ø§Ù„â€ŒÙ‡Ø§ÛŒ Ø®ØµÙˆØµÛŒ): -1001234567890
CHANNEL_ID = "@ECHOES_Mus"

# Ù…Ø³ÛŒØ± ÙØ§ÛŒÙ„ Ø¯ÛŒØªØ§Ø¨ÛŒØ³
DB_PATH = "music_bot.db"

# ØªØ¹Ø¯Ø§Ø¯ Ù†ØªØ§ÛŒØ¬ Ù†Ù…Ø§ÛŒØ´ Ø¯Ø§Ø¯Ù‡ Ø´Ø¯Ù‡ Ø¯Ø± Ù‡Ø± ØµÙØ­Ù‡ Ø¬Ø³ØªØ¬Ùˆ / Ù„ÛŒØ³Øª
PAGE_SIZE = 8

# Ø­Ø¯Ø§Ú©Ø«Ø± ØªØ¹Ø¯Ø§Ø¯ Ø´Ú©Ø³Øª Ù¾ÛŒØ§Ù¾ÛŒ Ù‡Ù†Ú¯Ø§Ù… Ø§ÛŒÙ†Ø¯Ú©Ø³ Ú©Ø±Ø¯Ù† Ú©Ø§Ù†Ø§Ù„ Ù‚Ø¨Ù„ Ø§Ø² ØªÙˆÙ‚Ù Ø®ÙˆØ¯Ú©Ø§Ø±
# (ÛŒØ¹Ù†ÛŒ Ø§Ú¯Ø± Û´Û° Ù¾ÛŒØ§Ù… Ù¾Ø´Øªâ€ŒØ³Ø±Ù‡Ù… Ø¯Ø± Ú©Ø§Ù†Ø§Ù„ Ù¾ÛŒØ¯Ø§ Ù†Ø´Ø¯ØŒ ÙØ±Ø¶ Ù…ÛŒâ€ŒØ´ÙˆØ¯ Ú©Ø§Ù†Ø§Ù„ ØªÙ…Ø§Ù… Ø´Ø¯Ù‡)
MAX_CONSECUTIVE_MISSES = 40

# ÙØ§ØµÙ„Ù‡ Ø²Ù…Ø§Ù†ÛŒ Ø¨ÛŒÙ† Ø¯Ø±Ø®ÙˆØ§Ø³Øªâ€ŒÙ‡Ø§ Ù‡Ù†Ú¯Ø§Ù… Ø§ÛŒÙ†Ø¯Ú©Ø³ Ú©Ø±Ø¯Ù† Ú©Ø§Ù†Ø§Ù„ (Ø¨Ø±Ø§ÛŒ Ø¬Ù„ÙˆÚ¯ÛŒØ±ÛŒ Ø§Ø² Ù…Ø­Ø¯ÙˆØ¯ÛŒØª ØªÙ„Ú¯Ø±Ø§Ù…)
INDEX_DELAY = 0.06
